{"format": "layers-model", "generatedBy": "keras v2.1.4", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 256, 256], "dtype": "float32", "sparse": false, "name": "input0"}, "inbound_nodes": []}, {"name": "conv10.23005182903749222_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv10.23005182903749222_pad", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_first"}, "inbound_nodes": [[["input0", 0, 0, {}]]]}, {"name": "conv10.23005182903749222", "class_name": "Conv2D", "config": {"name": "conv10.23005182903749222", "trainable": true, "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv10.23005182903749222_pad", 0, 0, {}]]]}, {"name": "bn10.20053864458101422", "class_name": "BatchNormalization", "config": {"name": "bn10.20053864458101422", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv10.23005182903749222", 0, 0, {}]]]}, {"name": "0.75502029942736", "class_name": "Activation", "config": {"name": "0.75502029942736", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn10.20053864458101422", 0, 0, {}]]]}, {"name": "conv2.bn10.802369887380708", "class_name": "BatchNormalization", "config": {"name": "conv2.bn10.802369887380708", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["0.75502029942736", 0, 0, {}]]]}, {"name": "conv20.08545214377651056", "class_name": "Activation", "config": {"name": "conv20.08545214377651056", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2.bn10.802369887380708", 0, 0, {}]]]}, {"name": "conv2.conv10.5361743003328232_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv2.conv10.5361743003328232_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv20.08545214377651056", 0, 0, {}]]]}, {"name": "conv2.conv10.5361743003328232", "class_name": "Conv2D", "config": {"name": "conv2.conv10.5361743003328232", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2.conv10.5361743003328232_pad", 0, 0, {}]]]}, {"name": "conv2.bn20.5283238106116896", "class_name": "BatchNormalization", "config": {"name": "conv2.bn20.5283238106116896", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2.conv10.5361743003328232", 0, 0, {}]]]}, {"name": "conv20.13037149183563423", "class_name": "Activation", "config": {"name": "conv20.13037149183563423", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2.bn20.5283238106116896", 0, 0, {}]]]}, {"name": "conv2.conv20.0038606141862017607_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv2.conv20.0038606141862017607_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv20.13037149183563423", 0, 0, {}]]]}, {"name": "conv2.conv20.0038606141862017607", "class_name": "Conv2D", "config": {"name": "conv2.conv20.0038606141862017607", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2.conv20.0038606141862017607_pad", 0, 0, {}]]]}, {"name": "conv2.bn30.004615294012257354", "class_name": "BatchNormalization", "config": {"name": "conv2.bn30.004615294012257354", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2.conv20.0038606141862017607", 0, 0, {}]]]}, {"name": "conv20.1537136810901244", "class_name": "Activation", "config": {"name": "conv20.1537136810901244", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2.bn30.004615294012257354", 0, 0, {}]]]}, {"name": "conv2.conv30.6380091732991631_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv2.conv30.6380091732991631_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv20.1537136810901244", 0, 0, {}]]]}, {"name": "conv2.downsample.00.5043636933866238", "class_name": "BatchNormalization", "config": {"name": "conv2.downsample.00.5043636933866238", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["0.75502029942736", 0, 0, {}]]]}, {"name": "conv2.conv30.6380091732991631", "class_name": "Conv2D", "config": {"name": "conv2.conv30.6380091732991631", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2.conv30.6380091732991631_pad", 0, 0, {}]]]}, {"name": "conv2.downsample.10.7925277561385002", "class_name": "Activation", "config": {"name": "conv2.downsample.10.7925277561385002", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2.downsample.00.5043636933866238", 0, 0, {}]]]}, {"name": "conv20.6474896334830329", "class_name": "Concatenate", "config": {"name": "conv20.6474896334830329", "trainable": true, "axis": 1}, "inbound_nodes": [[["conv2.conv10.5361743003328232", 0, 0, {}], ["conv2.conv20.0038606141862017607", 0, 0, {}], ["conv2.conv30.6380091732991631", 0, 0, {}]]]}, {"name": "conv2.downsample.20.20795011400296404", "class_name": "Conv2D", "config": {"name": "conv2.downsample.20.20795011400296404", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2.downsample.10.7925277561385002", 0, 0, {}]]]}, {"name": "conv20.6787410444953944", "class_name": "Add", "config": {"name": "conv20.6787410444953944", "trainable": true}, "inbound_nodes": [[["conv20.6474896334830329", 0, 0, {}], ["conv2.downsample.20.20795011400296404", 0, 0, {}]]]}, {"name": "0.2893595539648154", "class_name": "ZeroPadding2D", "config": {"name": "0.2893595539648154", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["conv20.6787410444953944", 0, 0, {}]]]}, {"name": "0.3562700616991372_pad", "class_name": "ZeroPadding2D", "config": {"name": "0.3562700616991372_pad", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["0.2893595539648154", 0, 0, {}]]]}, {"name": "0.3562700616991372", "class_name": "AveragePooling2D", "config": {"name": "0.3562700616991372", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["0.3562700616991372_pad", 0, 0, {}]]]}, {"name": "conv3.bn10.9011600147464808", "class_name": "BatchNormalization", "config": {"name": "conv3.bn10.9011600147464808", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["0.3562700616991372", 0, 0, {}]]]}, {"name": "conv30.03733135318181868", "class_name": "Activation", "config": {"name": "conv30.03733135318181868", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3.bn10.9011600147464808", 0, 0, {}]]]}, {"name": "conv3.conv10.6230579892648797_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv3.conv10.6230579892648797_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv30.03733135318181868", 0, 0, {}]]]}, {"name": "conv3.conv10.6230579892648797", "class_name": "Conv2D", "config": {"name": "conv3.conv10.6230579892648797", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3.conv10.6230579892648797_pad", 0, 0, {}]]]}, {"name": "conv3.bn20.7540474288125697", "class_name": "BatchNormalization", "config": {"name": "conv3.bn20.7540474288125697", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3.conv10.6230579892648797", 0, 0, {}]]]}, {"name": "conv30.1594900709738717", "class_name": "Activation", "config": {"name": "conv30.1594900709738717", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3.bn20.7540474288125697", 0, 0, {}]]]}, {"name": "conv3.conv20.20891373003284686_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv3.conv20.20891373003284686_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv30.1594900709738717", 0, 0, {}]]]}, {"name": "conv3.conv20.20891373003284686", "class_name": "Conv2D", "config": {"name": "conv3.conv20.20891373003284686", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3.conv20.20891373003284686_pad", 0, 0, {}]]]}, {"name": "conv3.bn30.1459100301835201", "class_name": "BatchNormalization", "config": {"name": "conv3.bn30.1459100301835201", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3.conv20.20891373003284686", 0, 0, {}]]]}, {"name": "conv30.18684991008116902", "class_name": "Activation", "config": {"name": "conv30.18684991008116902", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3.bn30.1459100301835201", 0, 0, {}]]]}, {"name": "conv3.conv30.8621276090800334_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv3.conv30.8621276090800334_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv30.18684991008116902", 0, 0, {}]]]}, {"name": "conv3.conv30.8621276090800334", "class_name": "Conv2D", "config": {"name": "conv3.conv30.8621276090800334", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3.conv30.8621276090800334_pad", 0, 0, {}]]]}, {"name": "conv30.29296806478673953", "class_name": "Concatenate", "config": {"name": "conv30.29296806478673953", "trainable": true, "axis": 1}, "inbound_nodes": [[["conv3.conv10.6230579892648797", 0, 0, {}], ["conv3.conv20.20891373003284686", 0, 0, {}], ["conv3.conv30.8621276090800334", 0, 0, {}]]]}, {"name": "conv30.6157925068033105", "class_name": "Add", "config": {"name": "conv30.6157925068033105", "trainable": true}, "inbound_nodes": [[["conv30.29296806478673953", 0, 0, {}], ["0.3562700616991372", 0, 0, {}]]]}, {"name": "conv4.bn10.9565432456897687", "class_name": "BatchNormalization", "config": {"name": "conv4.bn10.9565432456897687", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv30.6157925068033105", 0, 0, {}]]]}, {"name": "conv40.02214144751842506", "class_name": "Activation", "config": {"name": "conv40.02214144751842506", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4.bn10.9565432456897687", 0, 0, {}]]]}, {"name": "conv4.conv10.4447770094701977_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv4.conv10.4447770094701977_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv40.02214144751842506", 0, 0, {}]]]}, {"name": "conv4.conv10.4447770094701977", "class_name": "Conv2D", "config": {"name": "conv4.conv10.4447770094701977", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4.conv10.4447770094701977_pad", 0, 0, {}]]]}, {"name": "conv4.bn20.6813421261903303", "class_name": "BatchNormalization", "config": {"name": "conv4.bn20.6813421261903303", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4.conv10.4447770094701977", 0, 0, {}]]]}, {"name": "conv40.7892804219895979", "class_name": "Activation", "config": {"name": "conv40.7892804219895979", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4.bn20.6813421261903303", 0, 0, {}]]]}, {"name": "conv4.conv20.6187472531640607_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv4.conv20.6187472531640607_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv40.7892804219895979", 0, 0, {}]]]}, {"name": "conv4.conv20.6187472531640607", "class_name": "Conv2D", "config": {"name": "conv4.conv20.6187472531640607", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4.conv20.6187472531640607_pad", 0, 0, {}]]]}, {"name": "conv4.bn30.332170764251955", "class_name": "BatchNormalization", "config": {"name": "conv4.bn30.332170764251955", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4.conv20.6187472531640607", 0, 0, {}]]]}, {"name": "conv40.0025872069333919834", "class_name": "Activation", "config": {"name": "conv40.0025872069333919834", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4.bn30.332170764251955", 0, 0, {}]]]}, {"name": "conv4.conv30.18986388491669148_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv4.conv30.18986388491669148_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["conv40.0025872069333919834", 0, 0, {}]]]}, {"name": "conv4.downsample.00.7252991282606378", "class_name": "BatchNormalization", "config": {"name": "conv4.downsample.00.7252991282606378", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv30.6157925068033105", 0, 0, {}]]]}, {"name": "conv4.conv30.18986388491669148", "class_name": "Conv2D", "config": {"name": "conv4.conv30.18986388491669148", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4.conv30.18986388491669148_pad", 0, 0, {}]]]}, {"name": "conv4.downsample.10.604307684152542", "class_name": "Activation", "config": {"name": "conv4.downsample.10.604307684152542", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4.downsample.00.7252991282606378", 0, 0, {}]]]}, {"name": "conv40.5391922040063009", "class_name": "Concatenate", "config": {"name": "conv40.5391922040063009", "trainable": true, "axis": 1}, "inbound_nodes": [[["conv4.conv10.4447770094701977", 0, 0, {}], ["conv4.conv20.6187472531640607", 0, 0, {}], ["conv4.conv30.18986388491669148", 0, 0, {}]]]}, {"name": "conv4.downsample.20.909522184527504", "class_name": "Conv2D", "config": {"name": "conv4.downsample.20.909522184527504", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4.downsample.10.604307684152542", 0, 0, {}]]]}, {"name": "conv40.3442247930402429", "class_name": "Add", "config": {"name": "conv40.3442247930402429", "trainable": true}, "inbound_nodes": [[["conv40.5391922040063009", 0, 0, {}], ["conv4.downsample.20.909522184527504", 0, 0, {}]]]}, {"name": "m00.6959272257602114", "class_name": "ZeroPadding2D", "config": {"name": "m00.6959272257602114", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["conv40.3442247930402429", 0, 0, {}]]]}, {"name": "m00.7934122721986742_pad", "class_name": "ZeroPadding2D", "config": {"name": "m00.7934122721986742_pad", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["m00.6959272257602114", 0, 0, {}]]]}, {"name": "m00.7934122721986742", "class_name": "AveragePooling2D", "config": {"name": "m00.7934122721986742", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["m00.7934122721986742_pad", 0, 0, {}]]]}, {"name": "m0.b2_4.bn10.17972878778728185", "class_name": "BatchNormalization", "config": {"name": "m0.b2_4.bn10.17972878778728185", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m00.7934122721986742", 0, 0, {}]]]}, {"name": "m0.b2_40.5926955996206569", "class_name": "Activation", "config": {"name": "m0.b2_40.5926955996206569", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_4.bn10.17972878778728185", 0, 0, {}]]]}, {"name": "m0.b2_4.conv10.6245259459957456_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_4.conv10.6245259459957456_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_40.5926955996206569", 0, 0, {}]]]}, {"name": "m0.b2_4.conv10.6245259459957456", "class_name": "Conv2D", "config": {"name": "m0.b2_4.conv10.6245259459957456", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_4.conv10.6245259459957456_pad", 0, 0, {}]]]}, {"name": "m0.b2_4.bn20.1468858065832107", "class_name": "BatchNormalization", "config": {"name": "m0.b2_4.bn20.1468858065832107", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m0.b2_4.conv10.6245259459957456", 0, 0, {}]]]}, {"name": "m0.b2_40.33840789949957084", "class_name": "Activation", "config": {"name": "m0.b2_40.33840789949957084", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_4.bn20.1468858065832107", 0, 0, {}]]]}, {"name": "m0.b2_4.conv20.5273297604352278_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_4.conv20.5273297604352278_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_40.33840789949957084", 0, 0, {}]]]}, {"name": "m0.b2_4.conv20.5273297604352278", "class_name": "Conv2D", "config": {"name": "m0.b2_4.conv20.5273297604352278", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_4.conv20.5273297604352278_pad", 0, 0, {}]]]}, {"name": "m0.b2_4.bn30.5664979375151012", "class_name": "BatchNormalization", "config": {"name": "m0.b2_4.bn30.5664979375151012", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m0.b2_4.conv20.5273297604352278", 0, 0, {}]]]}, {"name": "m0.b2_40.9980825190281788", "class_name": "Activation", "config": {"name": "m0.b2_40.9980825190281788", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_4.bn30.5664979375151012", 0, 0, {}]]]}, {"name": "m0.b2_4.conv30.3312981137774872_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_4.conv30.3312981137774872_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_40.9980825190281788", 0, 0, {}]]]}, {"name": "m0.b2_4.conv30.3312981137774872", "class_name": "Conv2D", "config": {"name": "m0.b2_4.conv30.3312981137774872", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_4.conv30.3312981137774872_pad", 0, 0, {}]]]}, {"name": "m0.b2_40.7331246254066066", "class_name": "Concatenate", "config": {"name": "m0.b2_40.7331246254066066", "trainable": true, "axis": 1}, "inbound_nodes": [[["m0.b2_4.conv10.6245259459957456", 0, 0, {}], ["m0.b2_4.conv20.5273297604352278", 0, 0, {}], ["m0.b2_4.conv30.3312981137774872", 0, 0, {}]]]}, {"name": "m0.b2_40.3942045568233937", "class_name": "Add", "config": {"name": "m0.b2_40.3942045568233937", "trainable": true}, "inbound_nodes": [[["m0.b2_40.7331246254066066", 0, 0, {}], ["m00.7934122721986742", 0, 0, {}]]]}, {"name": "m00.030650384164257694", "class_name": "ZeroPadding2D", "config": {"name": "m00.030650384164257694", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_40.3942045568233937", 0, 0, {}]]]}, {"name": "m00.04992704126754899_pad", "class_name": "ZeroPadding2D", "config": {"name": "m00.04992704126754899_pad", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["m00.030650384164257694", 0, 0, {}]]]}, {"name": "m00.04992704126754899", "class_name": "AveragePooling2D", "config": {"name": "m00.04992704126754899", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["m00.04992704126754899_pad", 0, 0, {}]]]}, {"name": "m0.b2_3.bn10.5667738090762796", "class_name": "BatchNormalization", "config": {"name": "m0.b2_3.bn10.5667738090762796", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m00.04992704126754899", 0, 0, {}]]]}, {"name": "m0.b2_30.9403980356821119", "class_name": "Activation", "config": {"name": "m0.b2_30.9403980356821119", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_3.bn10.5667738090762796", 0, 0, {}]]]}, {"name": "m0.b2_3.conv10.9695152731694898_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_3.conv10.9695152731694898_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_30.9403980356821119", 0, 0, {}]]]}, {"name": "m0.b2_3.conv10.9695152731694898", "class_name": "Conv2D", "config": {"name": "m0.b2_3.conv10.9695152731694898", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_3.conv10.9695152731694898_pad", 0, 0, {}]]]}, {"name": "m0.b2_3.bn20.03756775466738094", "class_name": "BatchNormalization", "config": {"name": "m0.b2_3.bn20.03756775466738094", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m0.b2_3.conv10.9695152731694898", 0, 0, {}]]]}, {"name": "m0.b2_30.44298597646773497", "class_name": "Activation", "config": {"name": "m0.b2_30.44298597646773497", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_3.bn20.03756775466738094", 0, 0, {}]]]}, {"name": "m0.b2_3.conv20.4275458269053173_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_3.conv20.4275458269053173_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_30.44298597646773497", 0, 0, {}]]]}, {"name": "m0.b2_3.conv20.4275458269053173", "class_name": "Conv2D", "config": {"name": "m0.b2_3.conv20.4275458269053173", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_3.conv20.4275458269053173_pad", 0, 0, {}]]]}, {"name": "m0.b2_3.bn30.06680892288883711", "class_name": "BatchNormalization", "config": {"name": "m0.b2_3.bn30.06680892288883711", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m0.b2_3.conv20.4275458269053173", 0, 0, {}]]]}, {"name": "m0.b2_30.6933025544161473", "class_name": "Activation", "config": {"name": "m0.b2_30.6933025544161473", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_3.bn30.06680892288883711", 0, 0, {}]]]}, {"name": "m0.b2_3.conv30.887542803443842_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_3.conv30.887542803443842_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_30.6933025544161473", 0, 0, {}]]]}, {"name": "m0.b2_3.conv30.887542803443842", "class_name": "Conv2D", "config": {"name": "m0.b2_3.conv30.887542803443842", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_3.conv30.887542803443842_pad", 0, 0, {}]]]}, {"name": "m0.b2_30.8529868968895723", "class_name": "Concatenate", "config": {"name": "m0.b2_30.8529868968895723", "trainable": true, "axis": 1}, "inbound_nodes": [[["m0.b2_3.conv10.9695152731694898", 0, 0, {}], ["m0.b2_3.conv20.4275458269053173", 0, 0, {}], ["m0.b2_3.conv30.887542803443842", 0, 0, {}]]]}, {"name": "m0.b2_30.17840567245547623", "class_name": "Add", "config": {"name": "m0.b2_30.17840567245547623", "trainable": true}, "inbound_nodes": [[["m0.b2_30.8529868968895723", 0, 0, {}], ["m00.04992704126754899", 0, 0, {}]]]}, {"name": "m00.19674220138936882", "class_name": "ZeroPadding2D", "config": {"name": "m00.19674220138936882", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_30.17840567245547623", 0, 0, {}]]]}, {"name": "m00.4169429005473396_pad", "class_name": "ZeroPadding2D", "config": {"name": "m00.4169429005473396_pad", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["m00.19674220138936882", 0, 0, {}]]]}, {"name": "m00.4169429005473396", "class_name": "AveragePooling2D", "config": {"name": "m00.4169429005473396", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["m00.4169429005473396_pad", 0, 0, {}]]]}, {"name": "m0.b2_2.bn10.8780785789958931", "class_name": "BatchNormalization", "config": {"name": "m0.b2_2.bn10.8780785789958931", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m00.4169429005473396", 0, 0, {}]]]}, {"name": "m0.b2_20.20247603691854743", "class_name": "Activation", "config": {"name": "m0.b2_20.20247603691854743", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_2.bn10.8780785789958931", 0, 0, {}]]]}, {"name": "m0.b2_2.conv10.04318992851339831_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_2.conv10.04318992851339831_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_20.20247603691854743", 0, 0, {}]]]}, {"name": "m0.b2_2.conv10.04318992851339831", "class_name": "Conv2D", "config": {"name": "m0.b2_2.conv10.04318992851339831", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_2.conv10.04318992851339831_pad", 0, 0, {}]]]}, {"name": "m0.b2_2.bn20.03149558945451314", "class_name": "BatchNormalization", "config": {"name": "m0.b2_2.bn20.03149558945451314", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m0.b2_2.conv10.04318992851339831", 0, 0, {}]]]}, {"name": "m0.b2_20.9588929649542148", "class_name": "Activation", "config": {"name": "m0.b2_20.9588929649542148", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_2.bn20.03149558945451314", 0, 0, {}]]]}, {"name": "m0.b2_2.conv20.4682644397818049_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_2.conv20.4682644397818049_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_20.9588929649542148", 0, 0, {}]]]}, {"name": "m0.b2_2.conv20.4682644397818049", "class_name": "Conv2D", "config": {"name": "m0.b2_2.conv20.4682644397818049", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_2.conv20.4682644397818049_pad", 0, 0, {}]]]}, {"name": "m0.b2_2.bn30.8077520691471324", "class_name": "BatchNormalization", "config": {"name": "m0.b2_2.bn30.8077520691471324", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m0.b2_2.conv20.4682644397818049", 0, 0, {}]]]}, {"name": "m0.b2_20.9339689870037055", "class_name": "Activation", "config": {"name": "m0.b2_20.9339689870037055", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_2.bn30.8077520691471324", 0, 0, {}]]]}, {"name": "m0.b2_2.conv30.7817602204016408_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_2.conv30.7817602204016408_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_20.9339689870037055", 0, 0, {}]]]}, {"name": "m0.b2_2.conv30.7817602204016408", "class_name": "Conv2D", "config": {"name": "m0.b2_2.conv30.7817602204016408", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_2.conv30.7817602204016408_pad", 0, 0, {}]]]}, {"name": "m0.b2_20.935465436549483", "class_name": "Concatenate", "config": {"name": "m0.b2_20.935465436549483", "trainable": true, "axis": 1}, "inbound_nodes": [[["m0.b2_2.conv10.04318992851339831", 0, 0, {}], ["m0.b2_2.conv20.4682644397818049", 0, 0, {}], ["m0.b2_2.conv30.7817602204016408", 0, 0, {}]]]}, {"name": "m0.b2_20.08367147947846543", "class_name": "Add", "config": {"name": "m0.b2_20.08367147947846543", "trainable": true}, "inbound_nodes": [[["m0.b2_20.935465436549483", 0, 0, {}], ["m00.4169429005473396", 0, 0, {}]]]}, {"name": "m00.6958799235420897", "class_name": "ZeroPadding2D", "config": {"name": "m00.6958799235420897", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_20.08367147947846543", 0, 0, {}]]]}, {"name": "m00.9960168502996075_pad", "class_name": "ZeroPadding2D", "config": {"name": "m00.9960168502996075_pad", "trainable": true, "padding": [[0, 0], [0, 0]], "data_format": "channels_first"}, "inbound_nodes": [[["m00.6958799235420897", 0, 0, {}]]]}, {"name": "m00.9960168502996075", "class_name": "AveragePooling2D", "config": {"name": "m00.9960168502996075", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["m00.9960168502996075_pad", 0, 0, {}]]]}, {"name": "m0.b2_1.bn10.04760493171113922", "class_name": "BatchNormalization", "config": {"name": "m0.b2_1.bn10.04760493171113922", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m00.9960168502996075", 0, 0, {}]]]}, {"name": "m0.b2_10.61387176362713", "class_name": "Activation", "config": {"name": "m0.b2_10.61387176362713", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_1.bn10.04760493171113922", 0, 0, {}]]]}, {"name": "m0.b2_1.conv10.746283082245646_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_1.conv10.746283082245646_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_10.61387176362713", 0, 0, {}]]]}, {"name": "m0.b2_1.conv10.746283082245646", "class_name": "Conv2D", "config": {"name": "m0.b2_1.conv10.746283082245646", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_1.conv10.746283082245646_pad", 0, 0, {}]]]}, {"name": "m0.b2_1.bn20.40570703492644977", "class_name": "BatchNormalization", "config": {"name": "m0.b2_1.bn20.40570703492644977", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m0.b2_1.conv10.746283082245646", 0, 0, {}]]]}, {"name": "m0.b2_10.5896656259790747", "class_name": "Activation", "config": {"name": "m0.b2_10.5896656259790747", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_1.bn20.40570703492644977", 0, 0, {}]]]}, {"name": "m0.b2_1.conv20.8032314990741993_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_1.conv20.8032314990741993_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_10.5896656259790747", 0, 0, {}]]]}, {"name": "m0.b2_1.conv20.8032314990741993", "class_name": "Conv2D", "config": {"name": "m0.b2_1.conv20.8032314990741993", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["m0.b2_1.conv20.8032314990741993_pad", 0, 0, {}]]]}, {"name": "m0.b2_1.bn30.9605832788011968", "class_name": "BatchNormalization", "config": {"name": "m0.b2_1.bn30.9605832788011968", "trainable": true, "axis": 1, "momentum": 1.0, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["m0.b2_1.conv20.8032314990741993", 0, 0, {}]]]}, {"name": "m0.b2_10.3778048569435212", "class_name": "Activation", "config": {"name": "m0.b2_10.3778048569435212", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["m0.b2_1.bn30.9605832788011968", 0, 0, {}]]]}, {"name": "m0.b2_1.conv30.5128872171074264_pad", "class_name": "ZeroPadding2D", "config": {"name": "m0.b2_1.conv30.5128872171074264_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["m0.b2_10.3778048569435212", 0, 0, {}]]]}, {"name": "m0.b2_1.conv30.5128872171074264", "class_name": "Conv2D", "config": {"name": "m0.b2_1.conv30.5128872171074264", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, 