{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"name": "cp.resnet.conv1_24/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "cp.resnet.bn1_24/gamma", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.bn1_24/beta", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.bn1_24/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.bn1_24/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.conv1_24/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.bn1_24/gamma", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.bn1_24/beta", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.bn1_24/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.bn1_24/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.conv2_24/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.bn2_24/gamma", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.bn2_24/beta", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.bn2_24/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.0.bn2_24/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.conv1_22/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.bn1_22/gamma", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.bn1_22/beta", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.bn1_22/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.bn1_22/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.conv2_22/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.bn2_22/gamma", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.bn2_22/beta", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.bn2_22/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer1.1.bn2_22/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.conv1_24/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.bn1_24/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.bn1_24/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.bn1_24/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.bn1_24/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.conv2_24/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.downsample.0_24/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.bn2_24/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.bn2_24/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.bn2_24/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.bn2_24/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.downsample.1_24/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.downsample.1_24/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.downsample.1_24/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.0.downsample.1_24/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.conv1_24/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.bn1_24/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.bn1_24/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.bn1_24/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.bn1_24/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.conv2_24/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.bn2_24/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.bn2_24/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.bn2_24/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer2.1.bn2_24/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.conv1_23/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.bn1_23/gamma", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.bn1_23/beta", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.bn1_23/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.bn1_23/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.conv2_23/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.downsample.0_23/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.bn2_23/gamma", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.bn2_23/beta", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.bn2_23/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.bn2_23/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.downsample.1_23/gamma", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.downsample.1_23/beta", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.downsample.1_23/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.0.downsample.1_23/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.conv1_23/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.bn1_23/gamma", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.bn1_23/beta", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.bn1_23/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.bn1_23/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.conv2_23/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.bn2_23/gamma", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.bn2_23/beta", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.bn2_23/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer3.1.bn2_23/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.conv1_22/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.bn1_22/gamma", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.bn1_22/beta", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.bn1_22/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.bn1_22/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.conv2_22/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.downsample.0_22/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.bn2_22/gamma", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.bn2_22/beta", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.bn2_22/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.bn2_22/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.downsample.1_22/gamma", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.downsample.1_22/beta", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.downsample.1_22/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.0.downsample.1_22/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.conv1_22/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.bn1_22/gamma", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.bn1_22/beta", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.bn1_22/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.bn1_22/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.conv2_22/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.bn2_22/gamma", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.bn2_22/beta", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.bn2_22/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "cp.resnet.layer4.1.bn2_22/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "cp.arm32.conv.conv_22/kernel", "shape": [3, 3, 512, 128], "dtype": "float32"}, {"name": "cp.arm32.conv.bn_22/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.arm32.conv.bn_22/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.arm32.conv.bn_22/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.arm32.conv.bn_22/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.arm32.conv_atten_22/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "cp.conv_avg.conv_22/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "cp.arm16.conv.conv_22/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "cp.arm32.bn_atten_22/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.arm32.bn_atten_22/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.arm32.bn_atten_22/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.arm32.bn_atten_22/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_avg.bn_22/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_avg.bn_22/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_avg.bn_22/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_avg.bn_22/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.arm16.conv.bn_22/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.arm16.conv.bn_22/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.arm16.conv.bn_22/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.arm16.conv.bn_22/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.arm16.conv_atten_22/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "cp.arm16.bn_atten_22/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.arm16.bn_atten_22/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.arm16.bn_atten_22/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.arm16.bn_atten_22/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_head32.conv_21/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "cp.conv_head32.bn_21/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_head32.bn_21/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_head32.bn_21/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_head32.bn_21/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_head16.conv_21/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "cp.conv_head16.bn_21/gamma", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_head16.bn_21/beta", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_head16.bn_21/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "cp.conv_head16.bn_21/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "ffm.convblk.conv_21/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "ffm.convblk.bn_21/gamma", "shape": [256], "dtype": "float32"}, {"name": "ffm.convblk.bn_21/beta", "shape": [256], "dtype": "float32"}, {"name": "ffm.convblk.bn_21/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "ffm.convblk.bn_21/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "ffm.conv1_21/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "ffm.conv2_21/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv_out.conv.conv_21/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv_out.conv.bn_21/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv_out.conv.bn_21/beta", "shape": [256], "dtype": "float32"}, {"name": "conv_out.conv.bn_21/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv_out.conv.bn_21/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_out.conv_out_21/kernel", "shape": [1, 1, 256, 19], "dtype": "float32"}]}]}