{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of22.bin", "group1-shard2of22.bin", "group1-shard3of22.bin", "group1-shard4of22.bin", "group1-shard5of22.bin", "group1-shard6of22.bin", "group1-shard7of22.bin", "group1-shard8of22.bin", "group1-shard9of22.bin", "group1-shard10of22.bin", "group1-shard11of22.bin", "group1-shard12of22.bin", "group1-shard13of22.bin", "group1-shard14of22.bin", "group1-shard15of22.bin", "group1-shard16of22.bin", "group1-shard17of22.bin", "group1-shard18of22.bin", "group1-shard19of22.bin", "group1-shard20of22.bin", "group1-shard21of22.bin", "group1-shard22of22.bin"], "weights": [{"name": "conv1_1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv1_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv1_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2_2/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv3_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_2/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_3/bias", "shape": [256], "dtype": "float32"}, {"name": "conv4_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv4_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv4_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_2/bias", "shape": [512], "dtype": "float32"}, {"name": "conv4_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_3/bias", "shape": [512], "dtype": "float32"}, {"name": "conv5_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv5_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_2/bias", "shape": [512], "dtype": "float32"}, {"name": "conv5_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv5_3/bias", "shape": [512], "dtype": "float32"}, {"name": "fc6/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "fc6/bias", "shape": [1024], "dtype": "float32"}, {"name": "fc7/kernel", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "fc7/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv6_1/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv6_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_3_norm/conv3_3_norm_gamma", "shape": [256], "dtype": "float32"}, {"name": "conv6_2/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv6_2/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_3_norm_mbox_conf/kernel", "shape": [3, 3, 256, 4], "dtype": "float32"}, {"name": "conv3_3_norm_mbox_conf/bias", "shape": [4], "dtype": "float32"}, {"name": "conv7_1/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv7_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv4_3_norm/conv4_3_norm_gamma", "shape": [512], "dtype": "float32"}, {"name": "conv5_3_norm/conv5_3_norm_gamma", "shape": [512], "dtype": "float32"}, {"name": "conv7_2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv7_2/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_3_norm_mbox_loc/kernel", "shape": [3, 3, 256, 4], "dtype": "float32"}, {"name": "conv3_3_norm_mbox_loc/bias", "shape": [4], "dtype": "float32"}, {"name": "conv4_3_norm_mbox_conf/kernel", "shape": [3, 3, 512, 2], "dtype": "float32"}, {"name": "conv4_3_norm_mbox_conf/bias", "shape": [2], "dtype": "float32"}, {"name": "conv4_3_norm_mbox_loc/kernel", "shape": [3, 3, 512, 4], "dtype": "float32"}, {"name": "conv4_3_norm_mbox_loc/bias", "shape": [4], "dtype": "float32"}, {"name": "conv5_3_norm_mbox_conf/kernel", "shape": [3, 3, 512, 2], "dtype": "float32"}, {"name": "conv5_3_norm_mbox_conf/bias", "shape": [2], "dtype": "float32"}, {"name": "conv5_3_norm_mbox_loc/kernel", "shape": [3, 3, 512, 4], "dtype": "float32"}, {"name": "conv5_3_norm_mbox_loc/bias", "shape": [4], "dtype": "float32"}, {"name": "fc7_mbox_conf/kernel", "shape": [3, 3, 1024, 2], "dtype": "float32"}, {"name": "fc7_mbox_conf/bias", "shape": [2], "dtype": "float32"}, {"name": "fc7_mbox_loc/kernel", "shape": [3, 3, 1024, 4], "dtype": "float32"}, {"name": "fc7_mbox_loc/bias", "shape": [4], "dtype": "float32"}, {"name": "conv6_2_mbox_conf/kernel", "shape": [3, 3, 512, 2], "dtype": "float32"}, {"name": "conv6_2_mbox_conf/bias", "shape": [2], "dtype": "float32"}, {"name": "conv6_2_mbox_loc/kernel", "shape": [3, 3, 512, 4], "dtype": "float32"}, {"name": "conv6_2_mbox_loc/bias", "shape": [4], "dtype": "float32"}, {"name": "conv7_2_mbox_conf/kernel", "shape": [3, 3, 256, 2], "dtype": "float32"}, {"name": "conv7_2_mbox_conf/bias", "shape": [2], "dtype": "float32"}, {"name": "conv7_2_mbox_loc/kernel", "shape": [3, 3, 256, 4], "dtype": "float32"}, {"name": "conv7_2_mbox_loc/bias", "shape": [4], "dtype": "float32"}]}]}